Revit 2027 API
InternalDefinition.VariesAcrossGroups Property
Whether or not the parameter values can vary across group members.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool VariesAcrossGroups { get; }
Public ReadOnly Property VariesAcrossGroups As Boolean
	Get
public:
property bool VariesAcrossGroups {
	bool get ();
}
member VariesAcrossGroups : bool with get
Property Value
Boolean
True if the values of this parameter can vary across the related members of group instances. False if the values will be consistent across the related members in group instances.
See Also
Reference
InternalDefinition Class
Autodesk.Revit.DB Namespace